modules/multiDimAMR/tutorials/capillaryRisePlates2D/constant/g
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       uniformDimensionedVectorField;
    location    "constant";
    object      g;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -2 0 0 0 0];
value		( 0 -9.81 0);
//value		(0.684 -9.786 0); // 4° 
//value           ( 0.855 -9.7726 0); // 5°
//value           ( 1.703 -9.66 0); // 10
//value           ( 2.7 -9.43 0); // 17
//value           ( 3.194 -9.276 0); // 19
//value           ( 3.355 -9.218 0); // 19
//value           ( 4.15 -8.89 0); // 25
//value           ( 7.51 -6.31 0); // 50
//value           ( 9.218 -3.355 0); // 70
//value           ( 9.81 0 0); // 90


// ************************************************************************* //
