modules/multiDimAMR/tutorials/capillaryRisePlates2D/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


phases (water air);


//1bar, 20°C
water // 10 times more viscose 
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ]  10.04e-6;
    rho             rho [ 1 -3 0 0 0 0 0 ] 9.982e2;
}

air
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ]  15.35e-6;
    rho             rho [ 1 -3 0 0 0 0 0 ] 1.188;
}

sigma           sigma [ 1 0 -2 0 0 0 0 ] 72.75e-3;