modules/multiDimAMR/tutorials/capillaryRisePlates2D/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         leastSquares;    //Gauss linear;
    //default       cellMDLimited Gauss linear 0.5;
    grad(alpha1)    Gauss linear;
}

divSchemes
{
    div(rhoPhi,U)   Gauss skewCorrected linearUpwind grad(U);
    div(phi,alpha)  Gauss vanLeer; //Gauss vanLeer;
    div(phirb,alpha) Gauss interfaceCompression;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss skewCorrected linear;
}

laplacianSchemes
{
   default          Gauss linear corrected;
}

interpolationSchemes
{
    default         skewCorrected linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p_rgh;
    pcorr;
    alpha.water;
}


// ************************************************************************* //
